davidday99/tm4c-hal/libs/device_drivers/st7735.c
static uint8_t ColStart, RowStart; // some displays need this changed
static uint8_t Rotation;           // 0 to 3
static int16_t _width = ST7735_TFTWIDTH;   // this could probably be a constant, except it is used in Adafruit_GFX and depends on image rotation
static int16_t _height = ST7735_TFTHEIGHT;


/**
 * The Data/Command pin must be valid when the eighth bit is
 * sent.  The SSI module has hardware input and output FIFOs
 * that are 8 locations deep.  Based on the observation that
 * the LCD interface tends to send a few commands and then a
 * lot of data, the FIFOs are not used when writing
 * commands, and they are used when writing data.  This
 * ensures that the Data/Command pin status matches the byte
 * that is actually being transmitted.
 * The write command operation waits until all data has been
 * sent, configures the Data/Command pin for commands, sends
 * the command, and then waits for the transmission to
 * finish.
 * The write data operation waits until there is room in the
 * transmit FIFO, configures the Data/Command pin for data,
 * and then adds the data to the transmit FIFO.
 * NOTE: These functions will crash or stall indefinitely if
 * the SSI0 module is not initialized and enabled.
 */
void static writecommand(struct ST7735 *st7735, uint8_t c) {
    while (ssi_is_busy(st7735->ssi))
        ;
    set_gpio_pin_low(st7735->dat_com);
    write_ssi(st7735->ssi, &c, 1);

    while (ssi_is_busy(st7735->ssi))
        ;
}

void static writedata(struct ST7735 *st7735, uint8_t c) {
    while(!ssi_tx_ready(st7735->ssi))
        ;
    set_gpio_pin_high(st7735->dat_com);

    write_ssi(st7735->ssi, &c, 1);
}

void Delay1ms(uint32_t n){uint32_t volatile time;
    while(n){
        time = 72724*2/91;  // 1msec, tuned at 80 MHz
        while(time){
            time--;
        }
        n--;
    }
}

void static commandList(struct ST7735 *st7735, const uint8_t *addr) {

    uint8_t numCommands, numArgs;
    uint16_t ms;

    numCommands = *(addr++);               // Number of commands to follow

    while(numCommands--) {                 // For each command...
        writecommand(st7735, *(addr++));             //   Read, issue command
        numArgs = *(addr++);                //   Number of args to follow
        ms = numArgs & DELAY;          //   If hibit set, delay follows args
        numArgs &= ~DELAY;                   //   Mask out delay bit
        
        while(numArgs--) {                   //   For each argument...
            writedata(st7735, *(addr++));              //     Read, issue argument
        }

        if (ms) {
            ms = *(addr++);             // Read post-command delay time (ms)
            if(ms == 255)               // If 255, delay for 500 ms
                ms = 500;   
            Delay1ms(ms);
        }
    }
}

void ST7735_toggle_reset(struct ST7735 *st7735) {
    set_gpio_pin_low(st7735->ssi->fss);
    set_gpio_pin_high(st7735->rst);
    Delay1ms(500);
    set_gpio_pin_low(st7735->rst);
    Delay1ms(500);
    set_gpio_pin_high(st7735->rst);
    Delay1ms(500);
}

void static ST7735_init_peripherals(struct ST7735 *st7735) {
    ColStart = RowStart = 0; // May be overridden in init func

    init_gpio_port_clock(st7735->dat_com);
    init_gpio_pin_as_output(st7735->dat_com);
    init_gpio_pin_as_output(st7735->rst);

    disable_gpio_pin_alternate_function(st7735->dat_com);
    disable_gpio_pin_alternate_function(st7735->rst);

    init_gpio_pin_as_digital(st7735->dat_com);
    init_gpio_pin_as_digital(st7735->rst);

    ST7735_toggle_reset(st7735);

    init_ssi(st7735->ssi);
    init_ssi_clock_prescale_divider(st7735->ssi, 10);
    init_ssi_mode(st7735->ssi, 0, 0, 0, 0, 8);
    enable_ssi(st7735->ssi);
}

void ST7735_init(struct ST7735 *st7735) {
    ST7735_init_peripherals(st7735);
    
    // colstart, rowstart left at default '0' values
    commandList(st7735, Rcmd1);
    commandList(st7735, Rcmd2red);
    commandList(st7735, Rcmd3);

    ST7735_SetCursor(st7735, 0,0);
    text_color = ST7735_YELLOW;
    ST7735_FillScreen(st7735, 0);                 // set screen to black
}

// Set the region of the screen RAM to be modified
// Pixel colors are sent left to right, top to bottom
// (same as Font table is encoded; different from regular bitmap)
// Requires 11 bytes of transmission
void static setAddrWindow(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1) {

    writecommand(&ST7735, ST7735_CASET); // Column addr set
    writedata(&ST7735, 0x00);
    writedata(&ST7735, x0+ColStart);     // XSTART
    writedata(&ST7735, 0x00);
    writedata(&ST7735, x1+ColStart);     // XEND

    writecommand(&ST7735, ST7735_RASET); // Row addr set
    writedata(&ST7735, 0x00);
    writedata(&ST7735, y0+RowStart);     // YSTART
    writedata(&ST7735, 0x00);
    writedata(&ST7735, y1+RowStart);     // YEND

    writecommand(&ST7735, ST7735_RAMWR); // write to RAM
}

// Send two bytes of data, most significant byte first
// Requires 2 bytes of transmission
void static pushColor(uint16_t color) {
    writedata(&ST7735, (uint8_t)(color >> 8));
    writedata(&ST7735, (uint8_t)color);
}

//------------ST7735_DrawPixel------------
// Color the pixel at the given coordinates with the given color.
// Requires 13 bytes of transmission
// Input: x     horizontal position of the pixel, columns from the left edge
//               must be less than 128
//               0 is on the left, 126 is near the right
//        y     vertical position of the pixel, rows from the top edge
//               must be less than 160
//               159 is near the wires, 0 is the side opposite the wires
//        color 16-bit color, which can be produced by ST7735_Color565()
// Output: none
void ST7735_DrawPixel(int16_t x, int16_t y, uint16_t color) {

    if((x < 0) || (x >= _width) || (y < 0) || (y >= _height)) return;

    setAddrWindow(x,y,x,y);

    pushColor(color);
}

//------------ST7735_DrawFastVLine------------
// Draw a vertical line at the given coordinates with the given height and color.
// A vertical line is parallel to the longer side of the rectangular display
// Requires (11 + 2*h) bytes of transmission (assuming image fully on screen)
// Input: x     horizontal position of the start of the line, columns from the left edge
//        y     vertical position of the start of the line, rows from the top edge
//        h     vertical height of the line
//        color 16-bit color, which can be produced by ST7735_Color565()
// Output: none
void ST7735_DrawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color) {
    uint8_t hi = color >> 8, lo = color;

    // Rudimentary clipping
    if((x >= _width) || (y >= _height)) return;
    if((y+h-1) >= _height) h = _height-y;
    setAddrWindow(x, y, x, y+h-1);

    while (h--) {
    writedata(&ST7735, hi);
    writedata(&ST7735, lo);
    }
}

//------------ST7735_DrawFastHLine------------
// Draw a horizontal line at the given coordinates with the given width and color.
// A horizontal line is parallel to the shorter side of the rectangular display
// Requires (11 + 2*w) bytes of transmission (assuming image fully on screen)
// Input: x     horizontal position of the start of the line, columns from the left edge
//        y     vertical position of the start of the line, rows from the top edge
//        w     horizontal width of the line
//        color 16-bit color, which can be produced by ST7735_Color565()
// Output: none
void ST7735_DrawFastHLine(int16_t x, int16_t y, int16_t w, uint16_t color) {
    uint8_t hi = color >> 8, lo = color;

    // Rudimentary clipping
    if((x >= _width) || (y >= _height)) return;
    if((x+w-1) >= _width)  w = _width-x;
    setAddrWindow(x, y, x+w-1, y);

    while (w--) {
        writedata(&ST7735, hi);
        writedata(&ST7735, lo);
    }
}

