davidday99/tm4c-hal/libs/device_drivers/st7735.c
    line = 0x01;        // print the top row first
    // print the rows, starting at the top
    for(row=0; row<8; row=row+1){
        for(i=0; i<size; i=i+1){
            // print the columns, starting on the left
            for(col=0; col<5; col=col+1){
                if(Font[(c*5)+col]&line){
                // bit is set in Font, print pixel(s) in text color
                    for(j=0; j<size; j=j+1){
                        pushColor(textColor);
                    }
                } else{
                    // bit is cleared in Font, print pixel(s) in background color
                    for(j=0; j<size; j=j+1){
                        pushColor(bgColor);
                    }
                }
            }
            // print blank column(s) to the right of character
            for(j=0; j<size; j=j+1){
                pushColor(bgColor);
            }
        }
        line = line<<1;   // move up to the next row
    }
}

//------------ST7735_DrawString------------
// String draw function.
// 16 rows (0 to 15) and 21 characters (0 to 20)
// Requires (11 + size*size*6*8) bytes of transmission for each character
// Input: x         columns from the left edge (0 to 20)
//        y         rows from the top edge (0 to 15)
//        pt        pointer to a null terminated string to be printed
//        textColor 16-bit color of the characters
// bgColor is Black and size is 1
// Output: number of characters printed
uint32_t ST7735_DrawString(uint16_t x, uint16_t y, char *pt, int16_t textColor){
    uint32_t count = 0;
    if(y>15) return 0;
    while(*pt){
        ST7735_DrawCharS(x*6, y*10, *pt, textColor, ST7735_BLACK, 1);
        pt++;
        x = x+1;
        if(x>20) return count;  // number of characters printed
        count++;
    }
    return count;  // number of characters printed
}

//********ST7735_SetCursor*****************
// Move the cursor to the desired X- and Y-position.  The
// next character will be printed here.  X=0 is the leftmost
// column.  Y=0 is the top row.
// inputs: newX  new X-position of the cursor (0<=newX<=20)
//         newY  new Y-position of the cursor (0<=newY<=15)
// outputs: none
void ST7735_SetCursor(struct ST7735 *st7735, uint32_t newX, uint32_t newY){
    if((newX > 20) || (newY > 15)){       // bad input
        return;                             // do nothing
    }
    x_pos = newX;
    y_pos = newY;
}

// *************** ST7735_OutChar ********************
// Output one character to the LCD
// Position determined by ST7735_SetCursor command
// Color set by ST7735_SetTextColor
// Inputs: 8-bit ASCII character
// Outputs: none
//main.c
//Toggles the Red LED of TM4C Launchpad when SW1(PF4) is pushed and held
//PF4 is negative logic,i.e 0 is on and non-zero is off
void ST7735_OutChar(char ch){
    if((ch == 10) || (ch == 13) || (ch == 27)){
        y_pos++; x_pos=0;
        if(y_pos>15){
            y_pos = 0;
        }
        ST7735_DrawString(0,y_pos,"                     ",text_color);
        return;
    } else if (ch == 8) {
        if (x_pos == 0) {
            y_pos > 0 ? y_pos = 0 : y_pos--;
        } else {
            x_pos--;
        }
        ST7735_DrawCharS(x_pos*6,y_pos*10,' ',ST7735_YELLOW,ST7735_BLACK, 1);
        return;
    }
    ST7735_DrawCharS(x_pos*6,y_pos*10,ch,ST7735_YELLOW,ST7735_BLACK, 1);
    x_pos++;
    if(x_pos>20){
        x_pos = 20;
        ST7735_DrawCharS(x_pos*6,y_pos*10,'*',ST7735_RED,ST7735_BLACK, 1);
    }
    return;
}

//********ST7735_OutString*****************
// Print a string of characters to the ST7735 LCD.
// Position determined by ST7735_SetCursor command
// Color set by ST7735_SetTextColor
// The string will not automatically wrap.
// inputs: ptr  pointer to NULL-terminated ASCII string
// outputs: none
void ST7735_OutString(char *ptr){
    while(*ptr){
        ST7735_OutChar(*ptr);
        ptr = ptr + 1;
    }
}

// ************** ST7735_SetTextColor ************************
// Sets the color in which the characters will be printed
// Background color is fixed at black
// Input:  16-bit packed color
// Output: none
// ********************************************************
void ST7735_SetTextColor(uint16_t color){
    text_color = color;
}

// *************** Output_Init ********************
// Standard device driver initialization function for printf
// Initialize ST7735 LCD
// Inputs: none
// Outputs: none
void Output_Init(void){
    ST7735_init(&ST7735);
    ST7735_FillScreen(&ST7735, 0);                 // set screen to black
}
